<?php
//4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.

$alfabet = [
    'а' => 'a',
    'б' => 'b',
    'в' => 'v',
    'г' => 'g',
    'д' => 'd',
    'е' => 'e',
    'ё' => 'e',
    'ж' => 'zh',
    'з' => 'z',
    'и' => 'i',
    'й' => 'y',
    'к' => 'k',
    'л' => 'l',
    'м' => 'm',
    'н' => 'n',
    'о' => 'o',
    'п' => 'p',
    'р' => 'r',
    'с' => 's',
    'т' => 't',
    'у' => 'u',
    'ф' => 'f',
    'х' => 'h',
    'ц' => 'c',
    'ч' => 'ch',
    'ш' => 'sh',
    'щ' => 'sch',
    'ь' => '\'',
    'ы' => 'y',
    'ъ' => '\'',
    'э' => 'e',
    'ю' => 'yu',
    'я' => 'ya'
];

function translitStr($str, $alfabet)
{
    $str = mb_strtolower($str, 'UTF-8');
    $res = '';
    for ($i = 0, $len = mb_strlen($str); $i < $len; $i++) {
        $char = mb_substr($str, $i, 1);
        if (isset($alfabet[$char])) {
            $res .= $alfabet[$char];
        } else {
            $res .= $char;
        }
    }
    return $res;
}

echo translitStr('Привет мир!', $alfabet) . PHP_EOL;
echo translitStr('Смысловые галюцинации', $alfabet) . PHP_EOL;
